<?php
// return message(api)
$lang['BAPI0001'] = "APIキー不正";
$lang['BAPI0002'] = "パラメータチェックエラー";
$lang['BAPI0003'] = "バージョンチェックエラー";
$lang['BAPI1001'] = "回避不能な致命的なエラー";
$lang['BAPI1004'] = "該当レコードなしエラー";
$lang['BAPI1005'] = "エコ連泊プランの日付指定エラー";
$lang['BAPI1006'] = "予約変更できない(HNSで変更済み)";
$lang['BAPI1007'] = "検索対象ホテルは全部満室";
$lang['BCMN0000'] = "正常終了";
$lang['BCMN0001'] = "システムエラー";
$lang['BCMN0002'] = "引数エラー";
$lang['BCMN1001'] = "ＳＱＬエラー";
$lang['BCMN1002'] = "一意制約エラー";
$lang['BCMN1003'] = "排他制御エラー";
$lang['BCMN1004'] = "該当レコードなしエラー";
$lang['BGNL0001'] = "ログイン認証エラー";
$lang['BGNL0002'] = "重複レコードあり";
$lang['BGNL0003'] = "予約者情報更新失敗";
$lang['BGNL0004'] = "登録済みIDエラー";
$lang['BGNL0005'] = "会員情報なしエラー";
$lang['BGNL0006'] = "予約者情報無しエラー";
$lang['BGNL0007'] = "認証キー有効期限切れエラー";
$lang['BRSV0001'] = "在庫なしエラー";
$lang['BRSV0003'] = "会員情報不一致";
$lang['BRSV0004'] = "予約可能期間外";
$lang['BRSV0005'] = "会員ブロック残室不足";
$lang['BRSV0006'] = "予約重複";
$lang['BRSV0008'] = "予約キャンセル受付時間外";
$lang['BRSV0010'] = "サービス規制中";
$lang['BRSV0011'] = "予約受付時間外";
$lang['BRSV0012'] = "予約変更受付時間外";
$lang['BRSV1006'] = "該当する予約番号なし";
$lang['BRSV1007'] = "該該当する予約番号が即にキャンセル済み";
$lang['BRSV1008'] = "該当する予約番号が即にアサイン済み";
$lang['BRSV1009'] = "該当する予約番号の延泊が、残室不足で行えない";

// キーワード情報-交通手段
$lang['MNS_TRNPRTTN_1'] = "徒歩";
$lang['MNS_TRNPRTTN_2'] = "バス";
$lang['MNS_TRNPRTTN_3'] = "車";
$lang['MNS_TRNPRTTN_4'] = "その他";

// パスワード再設定（エラーメッセージ用）
$lang['ERR_MESSAGE_1'] = "該当するお客様の情報はありません。";
$lang['ERR_MESSAGE_2'] = "認証キーを発行して２４時間を過ぎたためパスワード再設定はできません。もう一度はじめからやり直してください。";
$lang['ERR_MESSAGE_3'] = "パスワードの値が正しくありません。パスワードの内容を変更してください。";
$lang['ERR_MESSAGE_4'] = "パスワードが入力されていません。";
$lang['ERR_MESSAGE_5'] = "パスワードと確認のためのパスワードが一致しません。";
$lang['ERR_MESSAGE_6'] = "システムエラーが発生しました。申しわけありませんが、初めからやり直してください。";
$lang['ERR_MESSAGE_7'] = "確認のパスワードが入力されていません。";

// パスワード再設定（画面項目名）
$lang['UI_TITLE'] = "パスワード忘れ";
$lang['UI_ID'] = "ID（メールアドレス）";
$lang['UI_PASS'] = "パスワード";
$lang['UI_PASS_CONF'] = "パスワードの再設定";
$lang['UI_PASS_COMP'] = "パスワードの設定の完了";
$lang['UI_PASS_ERR'] = "パスワード再設定エラー";
$lang['UI_BTN_SET'] = "設定";
$lang['UI_BTN_CONF'] = "確認";
$lang['UI_BTN_BACK'] = "戻る";

$lang['UI_STEP_3'] = "パスワード<BR>再設定";
$lang['UI_STEP_4'] = "再設定の<BR>確認";
$lang['UI_STEP_5'] = "再設定の<BR>完了";

$lang['UI_MESSAGE_1'] = "６桁以上の英数字で入力してください。";
$lang['UI_MESSAGE_2'] = "(英字･数字･記号などを組み合わせるとセキュリティが強化されます)";
$lang['UI_MESSAGE_3'] = "確認のためもう一度入力してください。";
$lang['UI_MESSAGE_4'] = "セキュリティの観点から表示しません。";
$lang['UI_MESSAGE_5'] = "新しいパスワードの設定が完了しました。";
